# FamilyName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementType..::..FamilyName Property
ElementType Class See Also
---
Gets the family name of this element type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string FamilyName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyName As String
	Get
```

Visual C++
---
```text
public:
property String^ FamilyName {
	String^ get ();
}
```

# Remarks
This value is a localized string describing the family in which this ElementType belongs. For family symbols, this will be the name of the associated Family. For system family types, this will be the name used to group related types, such as "Oval Duct" or "Curtain Wall".
# See Also
ElementType Class
Autodesk.Revit.DB Namespace